{
"0": {
        "name": "Warning 2",
        "video_url": "https:\/\/player.autoembed.cc\/embed\/movie\/1237618",
        "release_date": "18-07-2008",
        "quality": "1080p",
        "age_rating": "PG-13",
        "duration": "2 hours 32 minutes",
        "synopsis": "In Christopher Nolan's critically acclaimed film, Batman faces off against his most terrifying foe, the Joker, who pushes Gotham City into chaos and tests the hero's moral boundaries.",
        "description": "Starring Christian Bale as Batman and Heath Ledger as the Joker, 'The Dark Knight' is a masterful exploration of justice, chaos, and the human condition. The film's intense action sequences, psychological depth, and iconic performances make it one of the greatest superhero films ever made.",
        "image_url": "https:\/\/image.tmdb.org\/t\/p\/original\/fQHk7ydYdH0xem3CLPdRZUrKiNU.jpg",
        "rating": "9.0\/10",
        "timestamp": 97
    },
    "1": {
        "name": "Buhe Bariyan",
        "video_url": "https:\/\/player.autoembed.cc\/embed\/movie\/1175032",
        "release_date": "18-07-2008",
        "quality": "1080p",
        "age_rating": "PG-13",
        "duration": "2 hours 32 minutes",
        "synopsis": "In Christopher Nolan's critically acclaimed film, Batman faces off against his most terrifying foe, the Joker, who pushes Gotham City into chaos and tests the hero's moral boundaries.",
        "description": "Starring Christian Bale as Batman and Heath Ledger as the Joker, 'The Dark Knight' is a masterful exploration of justice, chaos, and the human condition. The film's intense action sequences, psychological depth, and iconic performances make it one of the greatest superhero films ever made.",
        "image_url": "https:\/\/image.tmdb.org\/t\/p\/original\/i1RX2UZ7cCjWkHKmZOeLjBnZjaJ.jpg",
        "rating": "9.0\/10",
        "timestamp": 99
    },
    "2": {
        "name": "Oye Bhole Oye",
        "video_url": "https:\/\/player.autoembed.cc\/embed\/movie\/1246507",
        "release_date": "18-07-2008",
        "quality": "1080p",
        "age_rating": "PG-13",
        "duration": "2 hours 32 minutes",
        "synopsis": "In Christopher Nolan's critically acclaimed film, Batman faces off against his most terrifying foe, the Joker, who pushes Gotham City into chaos and tests the hero's moral boundaries.",
        "description": "Starring Christian Bale as Batman and Heath Ledger as the Joker, 'The Dark Knight' is a masterful exploration of justice, chaos, and the human condition. The film's intense action sequences, psychological depth, and iconic performances make it one of the greatest superhero films ever made.",
        "image_url": "https:\/\/image.tmdb.org\/t\/p\/original\/6HvD6h7FlXgSkoT8urSL8rK9xJ.jpg",
        "rating": "9.0\/10",
        "timestamp": 100
    },
    "3": {
    "name": "Sarfira",
    "video_url": "https://player.autoembed.cc/embed/movie/967344", 
    "release_date": "10-07-2024",
    "quality": "HD",
    "age_rating": "PG-13",
    "duration": "2h 10m",
    "synopsis": "In 'Sarfira', a young, rebellious man challenges the societal norms of his small town. His fierce attitude and refusal to conform lead him into a series of adventures that test his courage, loyalty, and understanding of life. The film explores his journey from being misunderstood to becoming a hero in his own right.",
    "description": "'Sarfira' is a tale of defiance and self-discovery, focusing on a hot-headed protagonist who stands against the world to follow his own path. The film delves into the themes of individuality, freedom, and the cost of non-conformity. The character of Sarfira is wild and unyielding, with a personality that radiates confidence and rebellion. His interactions with the people around him – friends, family, and adversaries – reflect the deep-seated tension between tradition and change. As the story unfolds, viewers are taken through a whirlwind of emotions, as Sarfira’s bold actions have far-reaching consequences. With thrilling action scenes, heartfelt moments, and a powerful message, 'Sarfira' is a film that keeps the audience engaged and rooting for the underdog. The cinematography captures both the raw energy of Sarfira's adventures and the beauty of the landscapes he traverses. A compelling soundtrack accompanies his journey, enhancing the emotional weight of key moments. 'Sarfira' is a modern-day story about fighting for one's dreams, regardless of the obstacles in the way.",
    "image_url": "https://image.tmdb.org/t/p/original/b1FA9I8c12UTU3a5YCi1MUtAWnu.jpg", 
    "rating": "8.2/10",
    "timestamp": 103
},

   "4": {
    "name": "Gandhi 3",
    "video_url": "https://icloud-storage.cdncloud.store/?query=ZWRmbnhzLzYyMzE2NTE3Ny5wbnk%2FdWh2c3JxdmgtZnJxd2hxdy1nbHZzcnZsd2xycT1kd3dkZmtwaHF3JTNFJTIwaWxvaHFkcGglM0clMjI3S2x3UHJ5bGh2LmZrZHclMjAtJTIwSmRxZ2tsJTIwMyUyMDIwMjQlMjBTeHFtZGVsJTIwNDgwcyUyMEtHRkRQLnBueSUyMiZBLURwYy1GcnF3aHF3LVZrZDI1Nj1YUVZMSlFIRy1TREJPUkRHJkEtRHBjLURvanJ1bHdrcD1EWlY0LUtQREYtVktEMjU2JkEtRHBjLUZ1aGdocXdsZG89MzVlNjAwMzFmNzczMDVmMDgyMTBmMGUxZTMxMGY4NWclMkkyMDI0MTAxMiUySWR4d3IlMkl2MyUySWR6djRfdWh0eGh2dyZBLURwYy1HZHdoPTIwMjQxMDEyVzEzNDAxOEMmQS1EcGMtVmxqcWhnS2hkZ2h1dj1rcnZ3JkEtRHBjLUhhc2x1aHY9MTA4MDAmQS1EcGMtVmxqcWR3eHVoPWQxZ2VoNDAxZGhkN2VnMGRkaDlnMmcxNDMyZjg2OTk2aGdmZzBpZ2U2NGU1OTAxZzQ0ODY2NWZoMmRlNjdnaGg%3D&sd=bd99a88752a0c8e21239ef65c647cfb6", 
    "release_date": "11-October-2024", 
    "quality": "1080p", 
    "age_rating": "U/A", 
    "duration": "145 min", 
    "synopsis": "Rupinder Gandhi 3 (2024) is the third installment in the popular Punjabi biographical drama series, focusing on the life, legacy, and untold stories of the notorious gang leader-turned-reformist Rupinder Gandhi.", 
    "description": "Rupinder Gandhi 3 (2024) continues the gripping saga of Rupinder Gandhi, the influential figure who rose from a humble background to become both a feared gang leader and a symbol of change. This installment dives deeper into his transformation from a life of crime to a man fighting for justice and community betterment. As tensions rise between Gandhi and his old enemies, he faces challenges from rival gangs and law enforcement, testing his resolve to reform. The movie blends intense action sequences with emotional depth, offering a closer look at the complexities of Gandhi’s personality, his struggles for redemption, and the violent world he once navigated. Rupinder Gandhi 3 builds on the success of the previous films, with high-octane drama, thrilling storytelling, and a powerful message about the possibilities of change and reform.", 
    "image_url": "https://image.tmdb.org/t/p/original/4YNOImugCH52qxbM6jNEJ51eL7t.jpg", 
    "rating": "8.1", 
    "timestamp": 117
},
"5": {
    "name": "Shinda Shinda No Papa",
    "video_url": "Shinda_Shinda_No_Papa", 
    "release_date": "15-December-2024", 
    "quality": "1080p", 
    "age_rating": "U", 
    "duration": "130 min", 
    "synopsis": "Shinda Shinda No Papa (2024) is a heartwarming family comedy about a father’s misadventures as he tries to reconnect with his children through a series of hilarious and unexpected events.", 
    "description": "Shinda Shinda No Papa (2024) is a comedy that follows the life of Shinda, a clumsy yet lovable father who is always one step behind when it comes to understanding his modern, tech-savvy children. Determined to bridge the gap and rekindle his bond with them, Shinda embarks on a series of misadventures that involve everything from social media fails to chaotic family outings. As he stumbles through one comedic situation after another, he learns valuable lessons about family, love, and embracing the changing times. The film mixes laugh-out-loud moments with touching emotional scenes, making it a fun watch for audiences of all ages. With memorable performances and a heartwarming story, Shinda Shinda No Papa is a feel-good movie that celebrates the importance of family and the humorous side of fatherhood.", 
    "image_url": "https://image.tmdb.org/t/p/original/ouYSseDo6JPIXQnjdVFSnQ1l3E6.jpg", 
    "rating": "7.5", 
    "timestamp": 115
},
"6":{
    "name": "Ardaas Sarbat De Bhalle Di",
    "video_url": "https://www.filmyzilla.com.sl/downloads/26479/3/server_4/", 
    "release_date": "14-March-2024", 
    "quality": "1080p", 
    "age_rating": "U", 
    "duration": "160 min", 
    "synopsis": "Ardaas Sarbat De Bhalle Di (2024) is a Punjabi social drama that continues to explore the struggles, challenges, and emotional journeys of people as they navigate life, guided by the values of compassion and selflessness.", 
    "description": "Ardaas Sarbat De Bhalle Di (2024) is the third installment in the Ardaas film series, directed by Gippy Grewal. The film continues its exploration of the spiritual and emotional journeys of people from different walks of life, as they confront challenges, overcome hardships, and grow through the power of faith, community, and compassion. With heartwarming stories about everyday struggles—ranging from familial relationships, societal pressures, and moral dilemmas—the film is deeply rooted in the values of Sikhism, particularly focusing on the principle of 'Sarbat Da Bhalla', which means the well-being of all. Through thought-provoking storytelling, strong performances, and touching narratives, the film emphasizes the importance of selflessness, unity, and helping others. Ardaas Sarbat De Bhalle Di blends emotional drama, uplifting moments, and spiritual lessons, making it an inspiring watch for audiences.", 
    "image_url": "https://image.tmdb.org/t/p/original/lTsUaslhxDwg3rBhvGIKQY5T3Fm.jpg", 
    "rating": "8.4", 
    "timestamp": 118
},
"7":{
    "name": "Posti",
    "video_url": "https://icloud-storage.cdncloud.store/?query=ZWRmbnhzLzU0MzM5NTIwNS5wbnk%2FdWh2c3JxdmgtZnJxd2hxdy1nbHZzcnZsd2xycT1kd3dkZmtwaHF3JTNFJTIwaWxvaHFkcGglM0clMjI3S2x3UHJ5bGh2LmNscyUyMC0lMjBTcnZ3bCUyMDIwMjIlMjBTeHFtZGVsJTIwTmRlb2hycWglMjA0ODBzJTIwS0cucG55JTIyJkEtRHBjLUZycXdocXctVmtkMjU2PVhRVkxKUUhHLVNEQk9SREcmQS1EcGMtRG9qcnVsd2twPURaVjQtS1BERi1WS0QyNTYmQS1EcGMtRnVoZ2hxd2xkbz01ZGc5NjgwNzY0NjM2ODcxOTcwaTY0NjlkNzVpMTVmaCUySTIwMjQxMDEyJTJJZHh3ciUySXYzJTJJZHp2NF91aHR4aHZ3JkEtRHBjLUdkd2g9MjAyNDEwMTJXMTM0NTUzQyZBLURwYy1WbGpxaGdLaGRnaHV2PWtydncmQS1EcGMtSGFzbHVodj0xMDgwMCZBLURwYy1WbGpxZHd4dWg9NjZmNjBpNjJkaWhpNTk1ZzEwaGVmNmdkaDI1MjMxNGYxZmlkNDRpZjk5ODRpMmczaGkzMTJnZDllNzUyMDcxMA%3D%3D&sd=bf8e00bf2fd0edaac81fc991e9f89291",
    "release_date": "17-June-2022",
    "quality": "1080p",
    "age_rating": "U",
    "duration": "2h 20m",
    "synopsis": "A heartwarming drama tackling unemployment and drug addiction in rural Punjab.",
    "description": "*Posti* (2022), directed by Rana Ranbir, is a Punjabi-language film that explores social issues deeply rooted in rural Punjab. The film delves into the struggles of youth facing unemployment and the impact of drug addiction, wrapped in a narrative that also incorporates humor and hope. The protagonist, played by Babbal Rai, navigates the complexities of life in a village where opportunities are scarce and societal expectations are high.\n\nThe story is enriched by the performances of Surilie Gautam, Prince Kanwaljit Singh, and Raghveer Boli, each portraying characters that reflect the region’s harsh realities. With Gippy Grewal and Ravneet Kaur Grewal as producers, the movie benefits from a strong production backing, ensuring authenticity in both story and visuals.\n\nThe film was initially scheduled to release in 2020 but faced delays due to the pandemic, finally premiering on June 17, 2022. Its music, composed by Jay K and Desi Routz, complements the narrative by blending Punjabi folk sounds with contemporary beats. *Posti* resonates with audiences for its realistic portrayal of rural hardships and the message of perseverance, making it both entertaining and thought-provoking.",
    "image_url": "https://image.tmdb.org/t/p/original/4tEQ29JjaSJk3rLcabMOIeYVEmi.jpg",
    "rating": "7.2/10",
    "timestamp": 147
}


}