[
{
    "name": "Agatha: All Along(Hindi)",
    "release_date": "14-February-2024", 
    "quality": "1080p", 
    "age_rating": "TV-14", 
    "duration": "50 min per episode", 
    "synopsis": "Agatha: All Along (2024) is a Marvel spinoff series centered on the powerful and cunning witch Agatha Harkness, exploring her dark magic and mysterious past in the Marvel Cinematic Universe.", 
    "description": "Agatha: All Along (2024) brings the spotlight to the fan-favorite villain from WandaVision, Agatha Harkness, played by Kathryn Hahn. The series delves into Agatha's origins, her mastery of dark magic, and her manipulation of the mystical forces that have shaped her journey. Set in the Marvel Cinematic Universe, the show provides a deeper look at Agatha's motives and the events that led her to clash with Wanda Maximoff. As Agatha navigates new challenges and powerful enemies, viewers will discover the true extent of her abilities and the secrets she's been hiding. Blending humor, drama, and supernatural thrills, Agatha: All Along promises a captivating mix of Marvel’s signature storytelling with a darker, more magical twist. With strong performances, engaging plotlines, and connections to the larger MCU, the series is set to be a highlight for Marvel fans in 2024.", 
    "image_url": "https://image.tmdb.org/t/p/original/1tfCj5h0FEQ5xg8hzVjQgcuGlgN.jpg", 
    "rating": "8.2", 
    "timestamp": 112
},
{
    "name": "The Lord of the Rings: The Rings of Power",
    "release_date": "01-September-2022", 
    "quality": "4K", 
    "age_rating": "TV-14", 
    "duration": "60 min per episode", 
    "synopsis": "Set thousands of years before the events of J.R.R. Tolkien's The Hobbit and The Lord of the Rings, The Rings of Power follows the major events of Middle-earth's Second Age.", 
    "description": "The Lord of the Rings: The Rings of Power is an epic fantasy series set in the rich and expansive universe created by J.R.R. Tolkien. This highly anticipated series takes place during the Second Age of Middle-earth, long before the rise of Sauron and the forging of the One Ring. It explores the events that led to the rise and fall of kingdoms, the formation of the Rings of Power, and the journey of iconic characters as they navigate treachery, war, and unexpected alliances. With breathtaking visuals, a talented ensemble cast, and a compelling storyline that weaves together familiar lore and new narratives, The Rings of Power aims to captivate both long-time fans and new audiences alike. The series promises to delve into the depth of Middle-earth’s history, showcasing its diverse cultures, legendary heroes, and epic battles that shape the fate of the world.", 
    "image_url": "https://image.tmdb.org/t/p/original/mYLOqiStMxDK3fYZFirgrMt8z5d.jpg", 
    "rating": "8.6", 
    "timestamp": 124
},
{
    "name": "The Penguin(2024)",
    "release_date": "25-March-2024",
    "quality": "HD",
    "age_rating": "PG-13",
    "duration": "2h 20m",
    "synopsis": "The rise of Oswald Cobblepot as he navigates Gotham's criminal underworld, on his way to becoming the infamous Penguin.",
    "description": "The Penguin (2024) is a highly anticipated crime drama that delves into the origins of one of Gotham City's most notorious villains, Oswald Cobblepot, also known as The Penguin. Set against the grim backdrop of Gotham’s crime-infested streets, the film follows Oswald's ruthless ascent to power in the criminal underworld. After the fall of crime boss Carmine Falcone, a power vacuum opens, and Oswald seizes the opportunity to make his mark. With a sharp mind for business and an even sharper mind for manipulation, he works his way up, eliminating rivals and forging alliances, all while maintaining his public persona as a harmless club owner. However, beneath the surface lies a cold and calculating mind, one that will stop at nothing to get what he wants. The film explores Oswald’s complex personality, blending ambition, desperation, and madness. As he transforms into The Penguin, the film also touches on themes of power, corruption, and identity. With thrilling action sequences, dark humor, and a standout performance by the lead actor, The Penguin promises to be a gritty, character-driven film that brings depth to a classic villain from the Batman universe. Fans of the Batman franchise will find much to enjoy in this dark and atmospheric tale of betrayal and ambition.",
    "image_url": "https://image.tmdb.org/t/p/original/vOWcqC4oDQws1doDWLO7d3dh5qc.jpg",
    "rating": "Coming Soon",
    "timestamp": 131
},
{
    "name": "Wednesday",
    "release_date": "23-November-2022",
    "quality": "HD",
    "age_rating": "TV-14",
    "duration": "8 episodes (approx. 45-50 minutes each)",
    "synopsis": "Wednesday Addams, a teenager with a dark sense of humor and psychic abilities, attends Nevermore Academy to uncover a supernatural mystery linked to her family’s past.",
    "description": "Wednesday (2022) is a supernatural mystery series that brings a modern twist to the iconic character from *The Addams Family*. Starring Jenna Ortega as Wednesday Addams, the show follows her journey as she is sent to Nevermore Academy, a school for outcasts, where she must harness her psychic abilities to unravel a mystery tied to her family. With her trademark deadpan humor and macabre outlook on life, Wednesday navigates the challenges of high school life while also dealing with dangerous creatures, secret societies, and personal discoveries about her own powers. The series blends dark comedy, gothic elements, and coming-of-age themes, creating a fresh take on the beloved character. As Wednesday clashes with her peers, forms new friendships, and investigates a decades-old murder mystery, the show explores her unique personality and how she grapples with both her identity and her family’s legacy. Directed by Tim Burton, Wednesday is visually striking, filled with eerie settings, offbeat humor, and dynamic performances. The series has been praised for its balance of suspense, wit, and emotional depth, making it a hit with both long-time fans of *The Addams Family* and new audiences alike.",
    "image_url": "https://image.tmdb.org/t/p/original/9PFonBhy4cQy7Jz20NpMygczOkv.jpg",
    "rating": "8.1/10",
    "timestamp": 136
},
{
    "name": "Citadel: Diana",
    "release_date": "2024",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "1h 50m",
    "synopsis": "The next thrilling chapter in the Citadel universe, focusing on the mysterious and deadly agent Diana as she takes on a new global threat.",
    "description": "Citadel: Diana (2024) is a spin-off from the hit international spy thriller series *Citadel*, expanding on the universe with a fresh story centered around the enigmatic and highly skilled agent, Diana. Known for her deadly precision and tactical brilliance, Diana is drawn into a high-stakes mission that threatens global security. As new foes emerge and old alliances are tested, Diana must navigate a world of espionage, deception, and betrayal while facing challenges that put her lethal skills to the ultimate test. The film promises a continuation of the high-octane action, intricate plot twists, and stunning locations that *Citadel* fans have come to expect. With impressive fight choreography, intense suspense, and character-driven storytelling, Citadel: Diana is poised to push the boundaries of the spy thriller genre even further. Directed by a visionary filmmaker, the movie blends gritty realism with elements of psychological tension, making it a must-watch for fans of espionage action. As Diana’s story unfolds, audiences will be treated to a deep dive into her past, motivations, and the personal stakes that drive her every move.",
    "image_url": "https://image.tmdb.org/t/p/original/tJ4si3Kp6YnOsGMFdC4VaWINq5L.jpg",
    "rating": "Coming Soon",
    "timestamp": 138
},
{
    "name": "The Peripheral",
    "release_date": "21-October-2022",
    "quality": "High",
    "age_rating": "TV-MA",
    "duration": "60 minutes per episode",
    "synopsis": "In a near-future world, Flynne Fisher, a young woman living in rural America, discovers the consequences of piloting a robotic avatar in a virtual reality game. This leads her into a web of conspiracies that spans across timelines.",
    "description": "The Peripheral is a science fiction television series based on William Gibson's 2014 novel of the same name. Set in two distinct futures, the story follows Flynne Fisher, played by Chloë Grace Moretz, who lives in a small town where the illegal drug trade is rampant. In pursuit of a better life, Flynne becomes embroiled in a complex plot involving advanced virtual reality technology that allows her to control a robotic body, referred to as a Peripheral, in a future London ravaged by apocalyptic events. As she navigates this new world, Flynne discovers that her actions in the game have real-world consequences, leading to dangers for her and her family. The show combines elements of cyberpunk with a noirish murder mystery, exploring themes of technology, identity, and the impact of choices across timelines. It was created by the team behind the acclaimed series Westworld, promising a captivating narrative filled with twists and speculative elements.",
    "image_url": "https://image.tmdb.org/t/p/original/2e5NNQu9B1fXBNllRj8fzysCguP.jpg",    
    "rating": "7.5/10",
    "timestamp": 155
},
{
    "name": "Shadow and Bone",
    "release_date": "16-03-2023",
    "quality": "HD",
    "age_rating": "TV-14",
    "duration": "8 episodes, approx. 45-60 minutes each",
    "synopsis": "In a world divided by the Shadow Fold, a young soldier discovers she has extraordinary powers that could unite her country. As she navigates her new identity and the complex world of Grisha magic, she must confront the dangers posed by the Darkling and his forces.",
    "description": "Based on the Grishaverse novels by Leigh Bardugo, 'Shadow and Bone' is a captivating fantasy series that intertwines the storylines of Alina Starkov, a young soldier with untapped powers, and the infamous Crows, a group of skilled thieves. Season 1 introduced us to Alina's journey as she learns to harness her abilities and combat the evil General Kirigan, who seeks to control her. The second season, which premiered on March 16, 2023, continues the story with Alina and her friends embarking on a perilous quest. They must seek powerful allies and new sources of strength while facing formidable enemies, including the resurrected Kirigan, who poses an even greater threat with the shadow creatures at his command. The season delves deeper into the lore of the Grishaverse, introducing new characters and complex relationships. As Alina grapples with her identity and responsibilities, her love for Mal, her childhood friend, adds emotional depth to the narrative. The stakes are high, and the line between light and darkness blurs as alliances are tested and sacrifices must be made.",
    "image_url": "https://image.tmdb.org/t/p/original/mS9O9mjPlwpLTne4JgQlDkgREWA.jpg",
    "rating": "8.3",
    "timestamp": 156
},
{
    "name": "Heartstopper",
    "release_date": "22-04-2022",
    "quality": "HD",
    "age_rating": "TV-14",
    "duration": "8 episodes (avg. 30 minutes per episode)",
    "synopsis": "Heartstopper follows the blossoming romance between Charlie Spring, a shy and openly gay student, and Nick Nelson, a popular rugby player, as they navigate friendship, love, and self-discovery.",
    "description": "Directed by Euros Lyn, 'Heartstopper' is a coming-of-age romance series that captures the nuances of teenage relationships, mental health struggles, and LGBTQ+ identity. The series introduces viewers to Charlie Spring, a high-school student who falls for his new desk mate, Nick Nelson. As their bond deepens, Nick begins to question his own identity and feelings, leading to a heartfelt journey of love and self-acceptance. Heartstopper emphasizes the importance of friendship, empathy, and being true to oneself, with a light-hearted yet meaningful tone. The series was praised for its accurate representation of LGBTQ+ youth, refreshing positivity, and diverse cast. It has since become a cultural touchstone, resonating with viewers for its emotional storytelling and wholesome portrayal of young love.",
    "image_url": "https://image.tmdb.org/t/p/original/dQc0QbDiHjGmWxTfKtBgYtS4bj5.jpg",
    "rating": "8.6/10",
    "timestamp": 162
},
{
    "name": "Breaking Bad(Season 4 and 5)",
    "release_date": "20-January-2008", 
    "quality": "1080p", 
    "age_rating": "TV-MA", 
    "duration": "47 min per episode", 
    "synopsis": "Breaking Bad follows Walter White, a high school chemistry teacher turned methamphetamine manufacturer, as he descends into the criminal underworld to secure his family's financial future.", 
    "description": "Breaking Bad (2008–2013) is one of the most critically acclaimed television series, created by Vince Gilligan. The show chronicles the transformation of Walter White, a mild-mannered chemistry teacher diagnosed with terminal cancer, into a ruthless drug lord known as 'Heisenberg.' With the help of his former student, Jesse Pinkman, Walter enters the dangerous world of drug production, selling high-quality methamphetamine to secure his family's financial future. As Walter’s empire grows, the series explores themes of morality, family, and the consequences of unchecked ambition. The show is praised for its intense storytelling, complex characters, and iconic performances by Bryan Cranston and Aaron Paul. Over five seasons, Breaking Bad delivers shocking twists, unforgettable moments, and a dramatic journey of descent into the criminal world.", 
    "image_url": "https://image.tmdb.org/t/p/original/ineLOBPG8AZsluYwnkMpHRyu7L.jpg", 
    "rating": "9.5", 
    "timestamp": 166
},
{
    "name": "Hellbound",
    "release_date": "19-November-2021", 
    "quality": "1080p", 
    "age_rating": "TV-MA", 
    "duration": "50 min per episode", 
    "synopsis": "Hellbound (2021) is a supernatural thriller where mysterious beings condemn individuals to Hell, sparking chaos and fear in society as people confront their morality and beliefs.", 
    "description": "Hellbound (2021) is a South Korean supernatural thriller series directed by Yeon Sang-ho. Set in a world where otherworldly beings begin delivering prophecies of doom and condemning individuals to Hell, society descends into fear, chaos, and confusion. As public condemnations and brutal executions unfold, a religious group called The New Truth rises to power, claiming to interpret the mysterious phenomenon as divine punishment. The series explores humanity's reaction to fear, moral dilemmas, and societal control, questioning the very essence of justice and righteousness. With intense performances, gripping storytelling, and thought-provoking themes, Hellbound is both a horror show and a deep social commentary that resonates with global audiences.", 
    "image_url": "https://image.tmdb.org/t/p/original/vTbwq3jrb51UyUrrgSH2QRqRNMn.jpg", 
    "rating": "7.9", 
    "timestamp": 167
},
{
    "name": "Superman And Lois",
    "release_date": "23-February-2021", 
    "quality": "1080p", 
    "age_rating": "TV-PG", 
    "duration": "42 min per episode", 
    "synopsis": "Superman & Lois follows Clark Kent and Lois Lane as they navigate the challenges of parenthood while protecting the world from new and powerful threats.", 
    "description": "Superman & Lois (2021) is a refreshing take on the iconic superhero saga, focusing on the lives of Clark Kent and Lois Lane beyond their roles as hero and journalist. Now parents to two teenage sons, the couple faces new challenges as they balance the responsibilities of raising a family with the dangers that come with being Superman. The series explores relatable family dynamics, personal sacrifice, and the enduring struggle between duty and personal life. Set in the familiar yet updated landscape of Smallville, it introduces viewers to a blend of thrilling action sequences, heartfelt moments, and dramatic conflicts. With impressive visual effects and strong performances, Superman & Lois stands out as a modern superhero drama that appeals to both long-time fans and new audiences.", 
    "image_url": "https://image.tmdb.org/t/p/original/hoWkpACsrLgv4QMT4XCDrzoPdWN.jpg", 
    "rating": "8.2", 
    "timestamp": 172
},
{
    "name": "Suits",
    "release_date": "23-06-2011", 
    "quality": "HD",
    "age_rating": "TV-14",
    "duration": "44 min per episode",
    "synopsis": "Suits follows a brilliant college dropout, Mike Ross, who lands a job at a prestigious New York law firm despite never having attended law school. With the help of top lawyer Harvey Specter, Mike must navigate the legal world while keeping his secret hidden.",
    "description": "Set in the high-stakes world of corporate law, *Suits* tells the story of Mike Ross, a talented young man with a photographic memory who inadvertently lands a job as an associate at a top New York law firm, Pearson Specter. The firm’s best closer, Harvey Specter, sees Mike’s potential and takes him under his wing. However, Mike’s lack of a legal degree poses a constant threat to their success. As they tackle various legal challenges, the duo forms an unbreakable bond, while navigating office politics, personal conflicts, and moral dilemmas. With its sharp writing, witty dialogue, and complex characters, *Suits* explores themes of ambition, loyalty, and the gray areas of the law. The series became a cultural phenomenon, known for its compelling storylines and dynamic character development, particularly the evolving relationship between Mike and Harvey. Over its nine seasons, *Suits* delivers a captivating blend of drama and humor, making it a must-watch for fans of legal thrillers.",
    "image_url": "https://image.tmdb.org/t/p/original/vQiryp6LioFxQThywxbC6TuoDjy.jpg", 
    "rating": "8.5",
    "timestamp": 174 
},
{
    "name": "The Diplomat",
    "release_date": "20-04-2023",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "50 min per episode",
    "synopsis": "In *The Diplomat*, a career diplomat is thrust into an international crisis, testing her skills and alliances as she navigates the delicate balance of global politics and personal turmoil.",
    "description": "*The Diplomat* follows Kate Wyler, a seasoned U.S. diplomat, as she’s unexpectedly appointed as ambassador to the United Kingdom amidst a growing international crisis. With political tensions high and her marriage under strain, Kate must navigate the complexities of global diplomacy while also grappling with her personal life. As she attempts to broker peace and protect American interests abroad, she finds herself caught between powerful forces, both at home and abroad. With suspenseful twists and keen insights into the world of international relations, *The Diplomat* offers a gripping portrayal of the personal and political challenges that come with a high-stakes diplomatic role. This series combines drama, thriller, and political intrigue, inviting viewers to witness the fine line diplomats walk in the pursuit of peace and stability.",
    "image_url": "https://image.tmdb.org/t/p/original/nuqTVF7eS0FJFfF900VCbLjaMQe.jpg", 
    "rating": "7.8",
    "timestamp": 179
},
{
    "name": "Don't Come Home",
    "release_date": "18-09-2024",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "45 min per episode",
    "synopsis": "In *Don't Come Home*, a young woman returns to her hometown only to uncover dark secrets that make her question everything she thought she knew about her family and past.",
    "description": "*Don't Come Home (2024)* is a suspenseful thriller series that follows Emily Cooper, a young woman who returns to her secluded hometown after her mother’s mysterious disappearance. As Emily reconnects with estranged family members and old friends, she begins to unravel a web of secrets tied to her family’s dark past and the town’s hidden horrors. Strange occurrences and haunting clues suggest that her mother’s disappearance may be part of something far more sinister. With each episode, Emily is forced to confront memories she thought she’d left behind, as she discovers shocking truths about her family’s legacy and her own identity. Created by director Liam Reid, *Don't Come Home* blends elements of psychological horror and mystery, exploring themes of memory, family secrets, and the inescapable ties to one’s past. This series promises a gripping storyline filled with suspense, twists, and chilling revelations.",
    "image_url": "https://image.tmdb.org/t/p/original/25XI7EEUjs2U0dWEpA89Xx9Td0d.jpg", 
    "rating": "8.1",
    "timestamp": 180
},
{
    "name": "Paris Has Fallen",
     "release_date": "12-05-2024",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "50 min per episode",
    "synopsis": "In *Paris Has Fallen*, a former intelligence agent is forced out of retirement to save Paris from a deadly terrorist threat that could devastate the entire city.",
    "description": "*Paris Has Fallen (2024)* is an action-packed political thriller series that follows retired intelligence agent Jean-Luc Moreau as he’s called back into action when a coordinated terrorist attack threatens Paris. As attacks erupt across iconic landmarks, Moreau teams up with a rookie operative and a tech specialist to stop a mysterious organization known as 'The Phoenix' from taking control of the city. With high-stakes chases, explosive confrontations, and strategic maneuvers, Moreau uncovers layers of deception within the government, leading him to question his own past and those he trusted. Directed by Antoine Rousseau, *Paris Has Fallen* delivers suspense, intense action sequences, and a gritty portrayal of espionage and sacrifice. As the city faces its darkest hour, the series explores themes of loyalty, redemption, and the courage required to protect one's homeland in the face of overwhelming danger.",
    "image_url": "https://image.tmdb.org/t/p/original/eyK6fy2NWfjmyBjUvRAR14FynPK.jpg", 
    "rating": "8.5",
    "timestamp": 181 
},
{
    "name": "From",
      "release_date": "15-01-2024",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "50 min per episode",
    "synopsis": "In *From*, a mysterious town traps all who enter, forcing them to confront dark secrets and relentless threats.",
    "description": "*From (2024)* is a suspenseful horror series that plunges viewers into the eerie story of a town from which there is no escape. Every person who enters finds themselves trapped, unable to leave, and facing the relentless terror of supernatural forces that haunt the town’s borders. Led by Sheriff Boyd, the trapped residents struggle to survive, uncovering hidden truths about the town’s dark history and the horrifying entities that emerge at night. With each episode, tensions rise as alliances form and break, secrets unravel, and hope becomes a dangerous pursuit. Created by John Griffin and starring Harold Perrineau, *From* blends psychological horror with intense survival elements, making it a must-watch for fans of horror and mystery.",
    "image_url": "https://image.tmdb.org/t/p/original/cjXLrg4R7FRPFafvuQ3SSznQOd9.jpg", 
    "rating": "8.1",
    "timestamp": 191
},
{
    "name": "Doctor Stranger",
    "release_date": "05-05-2014",
    "quality": "HD",
    "age_rating": "TV-14",
    "duration": "60 min per episode",
    "synopsis": "In *Doctor Stranger*, a talented doctor escapes North Korea and returns to South Korea, but his past continues to haunt him as he navigates a complex world of medicine and espionage.",
    "description": "*Doctor Stranger* is a South Korean medical drama series that follows the life of Park Hoon, a gifted surgeon who, after being kidnapped as a child and raised in North Korea, escapes back to South Korea. Skilled but emotionally scarred, Hoon struggles to fit in, facing prejudice and dangerous conspiracies. Driven by the desire to reunite with his lost love, he faces rivalries and challenges within the medical field. Directed by Jin Hyuk, *Doctor Stranger* combines medical drama with thriller elements, capturing a story of resilience, survival, and love in the face of immense odds. Starring Lee Jong-suk and Jin Se-yeon, this series captivates with its high-stakes surgeries and emotional intensity.",
    "image_url": "https://image.tmdb.org/t/p/original/odH9cebqUNHKh1p6BKVSs0gsD34.jpg",
    "rating": "8.1",
    "timestamp": 193
},
{
    "name": "Murder Mindfully",
    "release_date": "14-03-2024",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "45 min per episode",
    "synopsis": "In *Murder Mindfully*, a therapist-turned-detective uses mindfulness techniques to solve dark and twisted murder cases.",
    "description": "*Murder Mindfully (2024)* is a crime thriller series that follows Dr. Julia Bennett, a former therapist who becomes an unconventional detective, using mindfulness and psychological insights to solve complex murder cases. Haunted by a past tragedy, Dr. Bennett takes on the darkest cases, where each suspect brings her closer to unraveling secrets about her own life. With every episode, she faces morally ambiguous situations, blurring the line between justice and personal vendettas. The series combines intense suspense, psychological depth, and emotional storytelling, offering a fresh take on crime-solving. Directed by acclaimed thriller director Alex Monroe and starring Claire Danes, *Murder Mindfully* challenges traditional detective work with a unique and introspective approach.",
    "image_url": "https://image.tmdb.org/t/p/original/3snsd7KLau14equwCz9YLZu9lTO.jpg", 
    "rating": "8.5",
    "timestamp": 196
},
{
    "name": "Like a Dragon: Yakuza",
    "release_date": "05-02-2024",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "50 min per episode",
    "synopsis": "In *Like a Dragon: Yakuza*, a former yakuza member navigates the treacherous underworld of crime while seeking redemption and revenge.",
    "description": "*Like a Dragon: Yakuza (2024)* is an action-packed crime drama series based on the beloved video game franchise. The story follows Kazuma Kiryu, a once-feared yakuza member who attempts to leave his violent past behind. As he navigates the gritty streets of Kamurocho, he becomes entangled in a web of betrayal, power struggles, and intense gang wars. With each episode, Kiryu confronts old enemies and new threats, all while trying to protect those he loves. Directed by renowned filmmaker Takashi Miike, the series captures the essence of the Yakuza world, blending action, drama, and emotional depth. Featuring a talented cast, *Like a Dragon: Yakuza* offers a thrilling exploration of honor, loyalty, and the quest for redemption in the ruthless criminal underworld.",
    "image_url": "https://image.tmdb.org/t/p/original/4uFt0lyo2UrMkTKCXH2VgxWz2jE.jpg",
    "rating": "8.3",
    "timestamp": 197
},
{
    "name": "Special Ops: Lioness",
    "release_date": "23-07-2023",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "50 min per episode",
    "synopsis": "In *Special Ops: Lioness*, a fearless undercover operative faces dangerous missions to bring down powerful enemies, protecting her country from within.",
    "description": "*Special Ops: Lioness* is an intense action-thriller series created by Taylor Sheridan that follows Joe, a CIA officer tasked with leading a covert female operative program known as the Lioness. Embedded within terrorist organizations, her recruits navigate complex missions to dismantle threats against national security from the inside. The series, starring Zoe Saldaña and Nicole Kidman, delivers high-stakes action and drama, focusing on the sacrifices and ethical challenges faced by those on the front lines of espionage. The gripping storyline and powerful performances make *Special Ops: Lioness* a riveting portrayal of courage, resilience, and the weight of duty.",
    "image_url": "https://image.tmdb.org/t/p/original/ajaXSmdAlYYhnvx1EIsvpfN949y.jpg", 
    "rating": "8.1",
    "timestamp": 203
},
{
    "name": "Tulsa King",
    "release_date": "TBD", 
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "45 min per episode",
    "synopsis": "In *Tulsa King*, a former mafia capo navigates his way through a new criminal world as he tries to rebuild his empire in Tulsa.",
    "description": "*Tulsa King (2024)* is a crime drama series that follows the story of Dwight ‘The General’ Manfredi, a seasoned mafia capo who is released from prison and sent to establish a new criminal empire in Tulsa, Oklahoma. With his old connections far behind and new alliances to form, he must adapt to an unfamiliar world filled with unexpected challenges and threats. Created by Taylor Sheridan and starring Sylvester Stallone, the series blends elements of action, dark humor, and drama as Dwight learns to conquer a city that’s as foreign to him as he is to it. *Tulsa King* explores themes of loyalty, adaptation, and power, capturing the complex dynamics of a seasoned criminal trying to regain his influence.",
    "image_url": "https://image.tmdb.org/t/p/original/zMFAdj30K84Sz90bCd6ePwiAO37.jpg", 
    "rating": "8.2",
    "timestamp": 204
},
{
  "name": "Tokyo Swindlers",
  "release_date": "25-07-2024",
  "quality": "HD",
  "age_rating": "TV-MA",
  "duration": "7 episodes",
  "synopsis": "A gang of swindlers led by Harrison Yamanaka sets out to execute a high-stakes real estate scam worth 10 billion yen, navigating risks from both their targets and the police.",
  "description": "Tokyo Swindlers is a thrilling Japanese crime series that explores the world of real estate fraud in Tokyo’s booming property market. The story centers on Takumi Tsujimoto, a negotiator working with a group of seasoned con artists. Led by mastermind Harrison Yamanaka, the team plans a massive heist involving high-profile landowners and developers, all while evading relentless pursuit from law enforcement. This seven-part series delves into deception, loyalty, and the moral ambiguities of each character as they push the limits to achieve their goals. Directed by Hitoshi One, it features standout performances from Go Ayano, Etsushi Toyokawa, and more.",
  "image_url": "https://image.tmdb.org/t/p/original/892R0peQpBJP6VnAiQWtAGxRUr.jpg",
  "rating": "7.3",
  "timestamp": 213
},
{
    "name": "Radiant Office",
    "release_date": "15-01-2024",
    "quality": "HD",
    "age_rating": "PG",
    "duration": "60 min",
    "synopsis": "A young woman who has been diagnosed with a terminal illness secures a job in a quirky office and discovers the power of friendship, work, and laughter.",
    "description": "*Radiant Office* (2024) is a heartfelt workplace drama that follows the journey of a young woman, Kim Ji-Na, who is diagnosed with a terminal illness but finds a new sense of purpose and joy when she joins a peculiar office. As Ji-Na faces the challenges of her condition, she unexpectedly bonds with her eccentric colleagues, learning to embrace life's uncertainties. With a perfect blend of humor, emotions, and workplace dynamics, *Radiant Office* delves into the themes of friendship, work relationships, and the human spirit, showing how even in the toughest times, laughter and support can help light the way.",
    "image_url": "https://image.tmdb.org/t/p/original/5cpANNfhpYNfPxvUNmQyvtMVTkQ.jpg",
    "rating": "7.4",
    "timestamp": 228
},
{
    "name": "Outer Banks",
    "release_date": "01-03-2024",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "50 min",
    "synopsis": "A group of teenagers from the Outer Banks of North Carolina discovers a long-buried secret that connects them to a legendary treasure hunt, testing their bonds of friendship and family.",
    "description": "*Outer Banks* (2024) returns for another thrilling season, continuing the high-stakes adventure of the Pogues as they navigate love, loyalty, and danger. This time, the group embarks on a quest to uncover a hidden treasure, leading them into a dangerous confrontation with both old enemies and new challenges. As the treasure hunt intensifies, friendships are tested, loyalties are questioned, and the true cost of their journey becomes clear. Filled with twists, cliffhangers, and gripping suspense, *Outer Banks* continues to explore themes of youth, rebellion, and the pursuit of dreams against a backdrop of scenic coastal beauty.",
    "image_url": "https://image.tmdb.org/t/p/original/ovDgO2LPfwdVRfvScAqo9aMiIW.jpg",
    "rating": "7.6",
    "timestamp": 229
},
{
    "name": "Paris Has Fallen",
    "release_date": "10-05-2024",
    "quality": "HD",
    "age_rating": "R",
    "duration": "110 min",
    "synopsis": "A former secret service agent must protect the French capital after a catastrophic attack leaves the city in chaos, and a deadly conspiracy threatens global security.",
    "description": "*Paris Has Fallen* (2024) is an action-packed thriller that follows Jake Carter, a former Secret Service agent who is forced to return to action when terrorists launch a devastating attack on Paris. As the city descends into chaos, Carter uncovers a dangerous conspiracy that threatens not only the security of France but the entire world. With breathtaking action sequences, high stakes, and a race against time, the movie takes viewers on a pulse-pounding journey through the iconic streets of Paris. As Carter faces his own personal demons, he must rely on his wits and combat skills to protect the innocent and stop a global disaster.",
    "image_url": "https://image.tmdb.org/t/p/original/eyK6fy2NWfjmyBjUvRAR14FynPK.jpg",
    "rating": "6.7",
    "timestamp": 230
},
{
    "name": "Every Minute Counts",
    "release_date": "15-06-2024",
    "quality": "HD",
    "age_rating": "PG-13",
    "duration": "105 min",
    "synopsis": "A high-stakes competition brings together a group of unlikely athletes, each racing against time to achieve their dreams, but personal challenges and intense rivalries threaten their goals.",
    "description": "*Every Minute Counts* (2024) follows a diverse group of athletes who enter an intense, high-stakes race where every second could determine their success or failure. With the clock ticking down, each participant must navigate not only the physical challenges of the competition but also their own personal struggles and the intense rivalries that develop along the way. Through determination, teamwork, and perseverance, they learn that victory isn't just about winning the race—it's about overcoming the obstacles within themselves. Full of heart-pounding moments, emotional highs and lows, and inspiring achievements, *Every Minute Counts* reminds us that every moment is an opportunity to change the course of our lives.",
    "image_url": "https://image.tmdb.org/t/p/original/f2R98auOoUk43Ub6OOVfV2M1kqo.jpg",
    "rating": "7.3",
    "timestamp": 231
},
{
    "name": "Arcane: League of Legends",
    "release_date": "06-11-2021",
    "quality": "HD",
    "age_rating": "TV-MA",
    "duration": "40 min per episode",
    "synopsis": "Set in the universe of *League of Legends*, *Arcane* explores the origins of iconic characters, showcasing their personal struggles, rivalries, and the creation of the fractured city of Piltover.",
    "description": "*Arcane: League of Legends* (2021) is an animated series set in the expansive world of the popular game *League of Legends*. It delves into the backstory of several key characters from the game, most notably sisters Vi and Jinx, exploring their complex relationship, the rise of their respective powers, and the divide between the wealthy city of Piltover and the oppressed underground of Zaun. With stunning animation, deep character development, and high stakes, *Arcane* offers both fans and newcomers a thrilling and emotional journey into a world filled with magic, science, and conflict. The series blends action, drama, and fantasy, making it a must-watch for fans of *League of Legends* and animation lovers alike.",
    "image_url": "https://image.tmdb.org/t/p/original/abf8tHznhSvl9BAElD2cQeRr7do.jpg",
    "rating": "8.8",
    "timestamp": 232
},
{
    "name": "Stranger Things(0)",
    "release_date": "15-07-2016",
    "quality": "HD",
    "age_rating": "TV-14",
    "duration": "50 min per episode",
    "synopsis": "In the 1980s, a group of kids uncovers supernatural mysteries, government experiments, and strange occurrences in their small town of Hawkins.",
    "description": "*Stranger Things* (2016) is a critically acclaimed sci-fi horror series that takes viewers back to the 1980s in the small town of Hawkins, Indiana. The series begins with the mysterious disappearance of a young boy, Will Byers, and the discovery of a psychokinetic girl named Eleven, who helps his friends uncover a dangerous parallel universe known as the Upside Down. Combining nostalgia, gripping suspense, and heartfelt character relationships, *Stranger Things* explores themes of friendship, family, and courage against the backdrop of supernatural forces and government conspiracies. The show has become a cultural phenomenon, beloved for its rich storytelling and iconic characters.",
    "image_url": "https://image.tmdb.org/t/p/original/uOOtwVbSr4QDjAGIifLDwpb2Pdl.jpg",
    "rating": "8.7",
    "timestamp": 233
},
{
  "name": "Alice in Borderland",
  "release_date": "2020-12-10",
  "quality": "HD",
  "age_rating": "TV-MA",
  "duration": "Season 1: 8 episodes, Season 2: 8 episodes",
  "synopsis": "A group of friends finds themselves in an abandoned Tokyo where they must compete in deadly games to survive, each game testing their wits, teamwork, and morality.",
  "description": "sci-fi, thriller, survival, mystery, drama, suspense, games, dystopian, action, psychological",
  "image_url": "https://image.tmdb.org/t/p/original/20mOwAAPwZ1vLQkw0fvuQHiG7bO.jpg",
  "rating": "8.2",
  "timestamp": 404
},
{
  "name": "Attack on Titan",
  "release_date": "07 April 2013",
  "quality": "HD",
  "age_rating": "87%",
  "duration": "Season 1: 25 episodes",
  "synopsis": "fascism, dystopia, politics, coup d'etat, gore giant monster, based on manga, super power, family tragedy, devastation, against the odds, dark fantasy, shounen, anime, war, plot twist, suspense, grand, amused, commanding, harsh",
  "description": "Many years ago, the last remnants of humanity were forced to retreat behind the towering walls of a fortified city to escape the massive, man-eating Titans that roamed the land outside their fortress. Only the heroic members of the Scouting Legion dared to stray beyond the safety of the walls – but even those brave warriors seldom returned alive. Those within the city clung to the illusion of a peaceful existence until the day that dream was shattered, and their slim chance at survival was reduced to one horrifying choice: kill – or be devoured!",
  "image_url": "https://image.tmdb.org/t/p/original/hTP1DtLGFamjfu8WqjnuQdP1n4i.jpg",
  "rating": "8.7",
  "timestamp": 446
},
{
  "name": "Squid Game 2",
  "release_date": "26 December 2024",
  "quality": "HD",
  "age_rating": "78%",
  "duration": "Season 2: 7 episodes",
  "synopsis": "secret organization, challenge, survival, fictional game show, cruelty, game, death match, prize,suspense, death game, thriller",
  "description": "Hundreds of cash-strapped players accept a strange invitation to compete in children's games. Inside, a tempting prize awaits — with deadly high stakes.",
  "image_url": "https://image.tmdb.org/t/p/original/caq0z9C2vvKdDhGe1EX6nerswV5.jpg",
  "rating": "7.8",
  "timestamp": 447
}




























]